from django.db import models
from django.conf import settings
from django.contrib.auth.models import AbstractUser, UserManager

from search.models import Lecture

majors = ((0, '정보없음'), (1, 'CHC융합전공'), (2, 'KMU International Business School'),
          (3, 'KMU International Business School International Business'), (4, 'KMU International School'),
          (5, 'KMU International School Information Technology'),
          (6, 'KMU International School International Business'), (7, 'UIT공학전공'), (8, '건설시스템공학부'),
          (9, '건설시스템공학부 건설시스템공학전공'), (10, '건축학부'), (11, '건축학부 건축설계전공'), (12, '건축학부 건축시스템전공'), (13, '건축학부 건축학전공'),
          (14, '건축학부(5년제)'), (15, '건축학부(5년제) 건축설계전공(5년제)'), (16, '건축학부(5년제) 건축학전공'), (17, '경영정보학부'),
          (18, '경영정보학부 경영정보전공'), (19, '경영정보학부 비즈니스IT전공'), (20, '경영정보학부 전자상거래전공'), (21, '경영정보학부 정보시스템전공'), (22, '경영학부'),
          (23, '경영학부 e-비즈니스전공'), (24, '경영학부 경영분석·통계전공'), (25, '경영학부 경영분석ㆍ통계전공'), (26, '경영학부 경영학전공'),
          (27, '경영학부 마케팅·생산전공'), (28, '경영학부 마케팅ㆍ생산전공'), (29, '경영학부 빅데이터경영통계전공'), (30, '경영학부 재무·금융전공'),
          (31, '경영학부 재무ㆍ금융전공'), (32, '경영학부 조직전략·국제경영전공'), (33, '경영학부 조직전략ㆍ국제경영전공'), (34, '경영학부 회계정보전공'), (35, '경제학과'),
          (36, '경제학부'), (37, '경제학부 경제학전공'), (38, '경제학부 국제통상학전공'), (39, '공간디자인학과'), (40, '공업디자인학과'), (41, '공연예술학부'),
          (42, '공연예술학부 무용전공'), (43, '공연예술학부 연극영화전공'), (44, '공연예술학부 연극전공'), (45, '공연예술학부 영화전공'), (46, '과학·기술·자연'),
          (47, '교양대학 교학팀'), (48, '교육학과'), (49, '교직'), (50, '국사학과'), (51, '국어국문학과'), (52, '국제통상학과'), (53, '국제학부'),
          (54, '국제학부 글로벌한국학전공'), (55, '국제학부 러시아학전공'), (56, '국제학부 일본학전공'), (57, '국제학부 중국학전공'), (58, '군사학'), (59, '글로벌'),
          (60, '금속공예학과'), (61, '기계·자동차공학부 기계공학전공'), (62, '기계·자동차공학부 기계자동차공학전공'), (63, '기계ㆍ자동차공학부 기계공학전공'),
          (64, '기계공학부'), (65, '기계공학부 기계시스템공학전공'), (66, '기계공학부 에너지기계공학전공'), (67, '기계공학부 융합기계공학전공'), (68, '기계시스템공학부'),
          (69, '기계시스템공학부 기계시스템공학전공'), (70, '기계시스템공학부 융합기계공학전공'), (71, '기업경영학부'), (72, '기업경영학부 기업경영전공'), (73, '기업융합법학과'),
          (74, '나노전자물리학과'), (75, '도자공예학과'), (76, '문학·언어'), (77, '미래기술융합디자인전공'), (78, '미술학부'), (79, '미술학부 입체미술전공'),
          (80, '미술학부 회화전공'), (81, '바이오기술전공'), (82, '바이오발효융합학과'), (83, '바이오헬스케어ㆍ식품연계전공'), (84, '발효융합학과'), (85, '법무학과'),
          (86, '법학부'), (87, '법학부 공법학전공'), (88, '법학부 사법학전공'), (89, '사회학과'), (90, '산림자원학과'), (91, '산림환경시스템학과'),
          (92, '생명나노화학과'), (93, '소통'), (94, '소프트웨어학부'), (95, '소프트웨어학부 소프트웨어전공'), (96, '수학과'), (97, '스포츠건강재활학과'),
          (98, '스포츠교육학과'), (99, '스포츠산업레저학과'), (100, '시각디자인학과'), (101, '식품영양학과'), (102, '신소재공학부'),
          (103, '신소재공학부 기계금속재료전공'), (104, '신소재공학부 신소재공학전공'), (105, '신소재공학부 전자화학재료전공'), (106, '실내디자인학과'),
          (107, '언론정보학부'), (108, '언론정보학부 광고학전공'), (109, '언론정보학부 광고홍보학전공'), (110, '언론정보학부 미디어전공'), (111, '언론정보학부 언론학전공'),
          (112, '역사·철학'), (113, '영상디자인학과'), (114, '영어영문학과'), (115, '영어영문학부'), (116, '영어영문학부 글로벌커뮤니케이션영어전공'),
          (117, '영어영문학부 영미어문전공'), (118, '예·체능계'), (119, '유라시아학과'), (120, '음악학부'), (121, '음악학부 관현악전공'),
          (122, '음악학부 성악전공'), (123, '음악학부 작곡전공'), (124, '음악학부 피아노전공'), (125, '응용화학과'), (126, '응용화학부'),
          (127, '응용화학부 나노소재전공'), (128, '응용화학부 바이오의약전공'), (129, '의상디자인학과'), (130, '인문I'), (131, '인문II'), (132, '인성교육'),
          (133, '일본학과'), (134, '임산공학과'), (135, '임산생명공학과'), (136, '자동차IT융합학과'), (137, '자동차·운송디자인학과'),
          (138, '자동차ㆍ운송디자인학과'), (139, '자동차공학과'), (140, '재무금융ㆍ회계학부'), (141, '재무금융ㆍ회계학부 재무금융전공'),
          (142, '재무금융ㆍ회계학부 회계학전공'), (143, '전자공학부'), (144, '전자공학부 에너지전자융합전공'), (145, '전자공학부 융합전자공학전공'),
          (146, '전자공학부 전자공학전공'), (147, '전자공학부 전자시스템공학전공'), (148, '정보보안암호수학과'), (149, '정치·경제·사회·세계'), (150, '정치외교학과'),
          (151, '중국학부'), (152, '중국학부 중국어문전공'), (153, '중국학부 중국정경전공'), (154, '중어중문학과'), (155, '창의'), (156, '체육학부'),
          (157, '체육학부 경기지도학전공'), (158, '체육학부 생활체육전공'), (159, '체육학부 스포츠건강재활전공'), (160, '체육학부 스포츠경영학전공'),
          (161, '체육학부 스포츠교육전공'), (162, '체육학부 스포츠산업·레저전공'), (163, '체육학부 스포츠산업ㆍ레저전공'), (164, '체육학부 스포츠산업학전공'),
          (165, '체육학부 스포츠지도전공'), (166, '체육학부 체육학전공'), (167, '컴퓨터공학부'), (168, '컴퓨터공학부 컴퓨터공학전공'), (169, '파이낸스·회계학부'),
          (170, '파이낸스·회계학부 파이낸스보험경영학전공'), (171, '파이낸스·회계학부 회계학전공'), (172, '파이낸스ㆍ회계학부'), (173, '파이낸스ㆍ회계학부 파이낸스보험경영학전공'),
          (174, '파이낸스ㆍ회계학부 회계학전공'), (175, '파이낸스보험경영학과'), (176, '학과미배정'), (177, '한국어문학부'), (178, '한국어문학부 국어국문학전공'),
          (179, '한국어문학부 글로벌한국어전공'), (180, '한국역사학과'), (181, '행정관리학과'), (182, '행정정책학부'), (183, '행정정책학부 정책학전공'),
          (184, '행정정책학부 행정학전공'), (185, '행정학과'))

grades = ((1, 1), (2, 2), (3, 3), (4, 4), (5, 5), (6, 6))


class CustomUser(AbstractUser):
    favorite_lectures = models.ManyToManyField("search.Lecture", blank=True)

    grade = models.PositiveSmallIntegerField("grade", null=True, blank=True)
    major = models.PositiveSmallIntegerField(null=True, blank=True)

    @property
    def favorite_lecture_pk(self):
        return self.favorite_lectures.all().values_list('pk', flat=True)

    def toggle_favorite_lecture(self, pk):
        """
        이미 찜을 했으면 remove : return False (찜목록에서 제거)
        찜을 안했다면 add : return True (찜목록에 추가)
        """
        lecture = Lecture.objects.filter(pk=pk)
        if lecture:
            filtered = self.favorite_lectures.filter(pk=pk)
            is_favorite = filtered.exists()
            if not is_favorite:
                self.favorite_lectures.add(pk)
            else:
                self.favorite_lectures.remove(pk)
            return not is_favorite
        return False

    def get_major(self):
        try:
            major_number = int(self.major)
            if major_number:
                return majors[major_number][1]
        except:
            return majors[0][1]

    @property
    def get_full_name(self):
        return self.last_name + " " + self.first_name